{"data":{"similar":{"page":1,"total_pages":159,"results":[{"adult":false,"backdrop_path":"/foPpmc95hUfmobDPmCFPzwNfZe7.jpg","genre_ids":[18,28,53],"id":22121,"name":"Truck Turner","overview":"Truck Turner and his partner Jerry, who make their living as bounty hunters in Los Angeles, are hired to hunt down Gator, a pimp who has skipped bail.","poster_path":"/lMB0WY73s8AOns9cUmdAT3USreo.jpg","release_date":"1974-06-26","mediaType":"movie"},{"adult":false,"backdrop_path":"/pFfCyTolgfcfYRQod6PEmbguUPV.jpg","genre_ids":[28,12,80,18,10749,53],"id":22160,"name":"Against All Odds","overview":"She was a beautiful fugitive. Fleeing from corruption. From power. He was a professional athlete past his prime. Hired to find her, he grew to love her. Love turned to obsession. Obsession turned to murder. And now the price of freedom might be nothing less than their lives.","poster_path":"/Ac0m41QYoxYBfRoU4cL491vOfEv.jpg","release_date":"1984-03-02","mediaType":"movie"},{"adult":false,"backdrop_path":"/ktce78LE6UjfWOufROWc0GKrLPU.jpg","genre_ids":[28,80,53],"id":23587,"name":"Vigilante","overview":"New York City factory worker Eddie Marino is a solid citizen and regular guy, until the day a sadistic street gang brutally assaults his wife and murders his child. When a corrupt judge sets the thugs free, Eddie goes berserk and vows revenge.","poster_path":"/7ALPQ9ActAUysGalAYpnbwl4OoP.jpg","release_date":"1983-01-04","mediaType":"movie"},{"adult":false,"backdrop_path":"/cN4qq4B8JR4ekuKAIKGVa4bBssl.jpg","genre_ids":[35,28,53,12],"id":25224,"name":"Masterminds","overview":"A rebellious teen uses his talent for pranks to outwit the security consultant who has taken the students at his prestigious private school hostage.","poster_path":"/l14qIp5XNV7AZ7En4xpbRHSDIpg.jpg","release_date":"1997-08-22","mediaType":"movie"},{"adult":false,"backdrop_path":"/4lyVnvQYs4aqTT9M8Du62y3rQSv.jpg","genre_ids":[53,80,10749,18],"id":25284,"name":"The Last Seduction","overview":"Looking to escape her unhappy marriage, villainous femme fatale Bridget Gregory convinces her husband, Clay, to sell cocaine, then steals the profits and runs out on him. She stops in a small town en route to Chicago, where she ensnares her next conquest, insurance man Mike Swale. After getting a job at his insurance company, Bridget convinces Mike to run a scam -- but things take a deadly turn when she recruits him to help get rid of her husband.","poster_path":"/kK8IiJDkz2Tv6DwaK60vJVHKH85.jpg","release_date":"1994-05-26","mediaType":"movie"},{"adult":false,"backdrop_path":"/e7ALownnual6u8tRmyQN0As7qXO.jpg","genre_ids":[28,53],"id":20605,"name":"The City of Violence","overview":"Tae-su, a detective fighting organized crime, returns to his hometown for his high school friend Wang-jae's funeral. There, he meets his old friends Pil-ho, Dong-hwan and Seok-hwan and they reminisce. Suspecting something fishy about Wang-jae's death, Tae-su and Seok-hwan start investigating it, each in his own way. Their investigations lead to a land development project that Pil-ho is directing.","poster_path":"/l2W7qEQejWlclNixeG8pbnnekkr.jpg","release_date":"2006-05-25","mediaType":"movie"},{"adult":false,"backdrop_path":"/tWLwgHd3LwSJlavUOFtpt8LLWHD.jpg","genre_ids":[80,18],"id":20637,"name":"Panic","overview":"Alex is going through a midlife crisis and it has become a very difficult time for him. His marriage is struggling, he's worried about his son, and his job of killing people for his family has become the most stressful part of his life. He seeks the help of a therapist and meets a woman in the waiting room that he connects with.","poster_path":"/gCaWBW6qQ0otWliRi0Gs4bAzgDX.jpg","release_date":"2000-12-01","mediaType":"movie"},{"adult":false,"backdrop_path":"/idViho2KKhx5SKOwSY2n7EotMIA.jpg","genre_ids":[80,18,10749],"id":20675,"name":"The Beast of the City","overview":"Police Chief Jim Fitzpatrick is after gangster Sam Belmonte. He uses his corrupt brother Ed to watch over Daisy who was associated with Belmonte.","poster_path":"/j7yvH2ngnLrM0yjRMJ3Yh8mk8VS.jpg","release_date":"1932-02-13","mediaType":"movie"},{"adult":false,"backdrop_path":"/dGxQiD7K9b3ClCaw7c4HogydoVA.jpg","genre_ids":[28,53,80],"id":20676,"name":"Deep Cover","overview":"Black police officer Russell Stevens applies for a special anti-drug squad which targets the highest boss of cocaine delivery to LA—the Colombian foreign minister's nephew. Russell works his way up from the bottom undercover, until he reaches the boss.","poster_path":"/etr2mCm7gMufAJkSLuB23XocDtd.jpg","release_date":"1992-04-15","mediaType":"movie"},{"adult":false,"backdrop_path":"/iIM3paU5p2yQXvQwnk3ykebY1xm.jpg","genre_ids":[12,35],"id":20678,"name":"Blankman","overview":"Darryl is a childlike man with a genius for inventing various gadgets out of junk. When he stumbles on a method to make his clothes bulletproof, he decides to use his skills to be the lowest budgeted superhero of all.","poster_path":"/9b1zje1Yp3kaJOn8pJqaQ1WLmoj.jpg","release_date":"1994-08-19","mediaType":"movie"},{"adult":false,"backdrop_path":null,"genre_ids":[35,28,878],"id":20693,"name":"Santos","overview":"Santos, a failed comic book artist, lives in a parallel universe where he's a superhero who has to save the world.","poster_path":"/oJKwIJ0q5Vyp7PWFoJoME9YXa52.jpg","release_date":"2008-10-10","mediaType":"movie"},{"adult":false,"backdrop_path":"/7zwngyl6Cg4NeD4AIOfpXgrcDv6.jpg","genre_ids":[28,35,10749],"id":22538,"name":"Scott Pilgrim vs. the World","overview":"As bass guitarist for a garage-rock band, Scott Pilgrim has never had trouble getting a girlfriend; usually, the problem is getting rid of them. But when Ramona Flowers skates into his heart, he finds she has the most troublesome baggage of all: an army of ex-boyfriends who will stop at nothing to eliminate him from her list of suitors.","poster_path":"/g5IoYeudx9XBEfwNL0fHvSckLBz.jpg","release_date":"2010-08-12","mediaType":"movie"},{"adult":false,"backdrop_path":"/71oqZMM6dgKvi1WQztOoUHSzDdZ.jpg","genre_ids":[53,80,18],"id":32040,"name":"The Killing of a Chinese Bookie","overview":"Cosmo Vittelli, the proprietor of a sleazy, low-rent Hollywood cabaret, has a real affection for the women who strip in his peepshows and the staff who keep up his dingy establishment. He also has a major gambling problem that has gotten him in trouble before. When Cosmo loses big-time at an underground casino run by mobster Mort, he isn't able to pay up. Mort then offers Cosmo the chance to pay back his debt by knocking off a pesky, Mafia-protected bookie.","poster_path":"/clQgmbmBOxvA2NepvijoL7YUCvr.jpg","release_date":"1976-02-15","mediaType":"movie"},{"adult":false,"backdrop_path":"/xe0vx2fhXKmXxrHd7nL5iMkaGw6.jpg","genre_ids":[53,80,9648],"id":32042,"name":"Night Moves","overview":"Private detective and former football player Harry Moseby gets hired on to what seems a standard missing person case, as a former Hollywood actress whose only major roles came thanks to being married to a studio mogul wants Moseby to find and return her daughter. Harry travels to Florida to find her, but he begins to see a connection between the runaway girl, the world of Hollywood stuntmen, and a suspicious mechanic when an unsolved murder comes to light.","poster_path":"/o6ZYabmfGPiuyTyUEXDsZOq90mR.jpg","release_date":"1975-02-27","mediaType":"movie"},{"adult":false,"backdrop_path":"/teEcBDHiT14m4uHOUhUfXrXnT7u.jpg","genre_ids":[18,53,80],"id":32047,"name":"Prince of the City","overview":"New York City detective Daniel Ciello agrees to help the United States Department of Justice help eliminate corruption in the police department, as long as he will not have to turn in any close friends. In doing so, Ciello uncovers a conspiracy within the force to smuggle drugs to street informants.","poster_path":"/2LtOyvE6P4tbmunPjOMI92CcEDl.jpg","release_date":"1981-08-19","mediaType":"movie"},{"adult":false,"backdrop_path":"/xwgKINVRSUtpgiYeYPMivDdxJY8.jpg","genre_ids":[53,28,80],"id":32050,"name":"The Black Windmill","overview":"A British agent's son is kidnapped and held for a ransom of diamonds. The agent finds out that he can't even count on the people he thought were on his side to help him, so he decides to track down the kidnappers himself.","poster_path":"/92lbZJZreeGYFdmjEuXuoQCbhL3.jpg","release_date":"1974-05-17","mediaType":"movie"},{"adult":false,"backdrop_path":"/6KUNcsjzLUmRwahwzNr5876HcIJ.jpg","genre_ids":[80,9648,53,35],"id":32059,"name":"The January Man","overview":"Nick and Frank Starkey were both policemen. A scandal forced Nick to leave the force, now a serial killer has driven the police to take him back. A web that includes Frank's wife, bribery, and corruption all are in the background as Nick tries to uncover the secret of where the killer will strike next, and finally must lay a trap without the police.","poster_path":"/5CZznrNvFLacr0mb4CYmlpJ4Tsw.jpg","release_date":"1989-01-13","mediaType":"movie"},{"adult":false,"backdrop_path":"/eVY5IXQVI2uugFFDZ7RTTc6SZe4.jpg","genre_ids":[28,12,53,18],"id":32065,"name":"Forced Vengeance","overview":"A casino security guard is forced into violence from when the Hong Kong mob threatens his friends.","poster_path":"/3AaPWvywczDIeGFCjUvohBIMzJL.jpg","release_date":"1982-07-30","mediaType":"movie"},{"adult":false,"backdrop_path":"/zb2l9iPzBRAYIngSslK6nNj2A4T.jpg","genre_ids":[80,18],"id":32077,"name":"True Confessions","overview":"A cop clashes with his priest brother while investigating the brutal murder of a young prostitute.","poster_path":"/qwTwHKesH4QcvSBkS1dE89AIFst.jpg","release_date":"1981-09-25","mediaType":"movie"},{"adult":false,"backdrop_path":"/rep3HeHtzw3fmlGl7SKRnBG98gv.jpg","genre_ids":[99],"id":30329,"name":"The Alps - Climb of Your Life","overview":"In 1966, John Harlin II died while attempting Europe's most difficult climb, the North Face of the Eiger in Switzerland. 40 years later, his son John Harlin III, an expert mountaineer and the editor of the American Alpine Journal, returns to attempt the same climb.","poster_path":"/luBD4ihgo8aH5Yh9CGUbasra5Sv.jpg","release_date":"2007-03-30","mediaType":"movie"}]}}}